#include <iostream>
using namespace std;
int main(){ 
//  +

    cout << 10 + 10 << "\n"; 
    cout << sizeof(10 + 10) <<"\n" ; // int  => 4
    cout << 10.5 + 9.5 << "\n"; // 20
    cout << sizeof(10.5 + 9.5) << "\n" ; // double => 8 
    cout << int(10.5 + 9.5) << "\n"; // 20
    cout << sizeof(int(10.5 + 9.5)) << "\n" ; // int  => 4

//  -

    cout << 100 - 50 << "\n" ; // 50
    cout << 100 - -50 << "\n" ; // 150

//  *

    cout << 10 * 5 << "\n" ; // 50

//  /

    cout << 20/5 << "\n" ; // 4
    cout << 12/5 << "\n" ; // 2 => عشان يعتبر ده قسمة أنتجر على أنتجر فـ الناتج هيبقى أنتجر
    cout << 12.f / 5.f << "\n" ; // 2.4

//  %

    cout << 20%5 << "\n" ; // 0 => مفيش باقي من القسمة الرقم طالع مظبوط
    cout << 24%5 << "\n" ; // 4 => في أربع أرقام زيادة عن أن القسمة تكون مظبوطة 
    // cout << 24.5 % 5 << "\n" ; // هتطلع فيها غلط عشان الأرقام لازم تكون أنتجر
    return 0 ;

}