#include <iostream>
using namespace std;
int main (){
    // عشان أعرف الأرقام دي زوجية ولا فردية بستخدم الموديلو 
    cout << 6 % 2 << "\n";  // 0 => يبقى زوجي 
    cout << 8 % 2 << "\n";  // 0 => يبقى زوجي 
    cout << 10 % 2 << "\n"; // 0 => يبقى زوجي 
    cout << 11 % 2 << "\n"; // 1 => يبقى زوجي فردي عشان رجع رقم من القسمة على 2
    
    cout << "===========================\n";

//  +

    int a = 10;
    a += 10; //  a = a + 10 => 20
    cout << a << "\n";

//  -

    int b = 10;
    b -= 5; //  b = b - 5 => 5
    cout << b << "\n";

//  *

    int c = 2;
    c *= 5; //  c = c * 5 => 10 
    cout << c << "\n";

//  /

    int d = 4;
    d /= 2; //  d = d / 2 => 2
    cout << d << "\n";

//  %

    int e = 4;
    e %= 2; //  e = e % 2 => 0
    cout << e << "\n";

    cout << "===========================\n";

    return 0;
}